In [1]:
%matplotlib inline
import pandas as pd

In [2]:
Title = pd.read_csv("titles.csv")
Title.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [3]:
Release_date = pd.read_csv("release_dates.csv")
Release_date.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

In [4]:
Cast = pd.read_csv("cast.csv")
Cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [5]:
print("Number of movies are listed in titles dataframe :- ")
Title.title.nunique()

Number of movies are listed in titles dataframe :-

223828

### What are the earliest two films listed in the titles dataframe?

In [6]:
print("Earliest two films listed in Title Dataframe :- ")
Title.sort_values('year').head(2)

Earliest two films listed in Title Dataframe :-

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [7]:
Title[Title['title']=="Hamlet"].shape[0]

20

### How many movies are titled "North by Northwest"?

In [8]:
Title[Title['title']=="North by Northwest"].shape[0]

1

### When was the first movie titled "Hamlet" made?

In [9]:
Hamlet = Title[Title['title'] =="Hamlet"].sort_values('year')
Hamlet.head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [10]:
TreasureIsland = Title[Title['title'] =="Treasure Island"].sort_values('year')
TreasureIsland

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [11]:
Title[Title.year== 1950].shape[0]

1113

### How many movies were made in the year 1960?

In [12]:
Title[Title.year== 1960].shape[0]

1549

### How many movies were made from 1950 through 1959?

In [13]:
Movies = (Title[(Title['year'] >= 1950) & (Title['year'] < 1959)])
len(Movies)

11419

### In what years has a movie titled "Batman" been released?

In [14]:
batman = Title[Title['title'] == 'Batman'].sort_values('year')
batman

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [15]:
Inception = Cast[Cast['title']=='Inception'].character.shape[0]
Inception

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [16]:
Inception = Cast[Cast['title']=='Inception'].isna().sum()
Inception

title         0
year          0
name          0
type          0
character     0
n            27
dtype: int64

### But how many roles in the movie "Inception" did receive an "n" value?

In [17]:
Inception = Cast[Cast['title']=='Inception'].shape[0] - Cast[Cast['title']=='Inception'].isnull().sum().sum()
Inception

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [18]:
temp = Cast[(Cast['title']=='North by Northwest') & (Cast['n'].notnull())]
temp[['name','n']].sort_values('n')

                         name     n
871426             Cary Grant   1.0
3518333       Eva Marie Saint   2.0
1457165           James Mason   3.0
3157232   Jessie Royce Landis   4.0
356707         Leo G. Carroll   5.0
3048272  Josephine Hutchinson   6.0
1695173           Philip Ober   7.0
1275337         Martin Landau   8.0
2447081         Adam Williams   9.0
1811387          Edward Platt  10.0
665768      Robert Ellenstein  11.0
2295714          Les Tremayne  12.0
464736        Philip Coolidge  13.0
1508344         Patrick McVey  14.0
206471           Edward Binns  15.0
1384780             Ken Lynch  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [19]:
temp = Cast[(Cast['title']=='Sleuth') & (Cast['n'].notnull()) & (Cast['year']==1972)]
temp[['name','n']].sort_values('n')

                       name    n
1705394    Laurence Olivier  1.0
326773        Michael Caine  2.0
373876       Alec Cawthorne  3.0
1465483  John (II) Matthews  4.0
2724553  Eve (III) Channing  5.0
1448690        Teddy Martin  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [20]:
emp = Cast[(Cast['title']=='Sleuth') & (Cast['n'].notnull()) & (Cast['year']==2007)]
emp[['name','n']].sort_values('n')

                  name    n
326774   Michael Caine  1.0
1293634       Jude Law  2.0
1805907  Harold Pinter  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [21]:
Cast[(Cast['title'] == 'Hamlet') & (Cast['year'] == 1921)].character.shape[0]

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [22]:
Cast[(Cast['title'] == 'Hamlet') & (Cast['year'] == 1996)].character.shape[0]

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [23]:
Cast[Cast['title'] == 'Hamlet'].character.shape[0]

342

### How many people have played an "Ophelia"?

In [24]:
Cast[Cast['title'] == 'Ophelia'].character.shape[0]

20

### How many people have played a role called "The Dude"?

In [25]:
Cast[Cast['character'] == 'The Dude'].character.shape[0]

19

### How many people have played a role called "The Stranger"?

In [26]:
Cast[Cast['character'] == 'The Stranger'].character.shape[0]

212

### How many roles has Sidney Poitier played throughout his career?

In [27]:
Cast[Cast['name'] == 'Sidney Poitier'].shape[0]

43

### How many roles has Judi Dench played?

In [28]:
Cast[Cast['name'] == 'Judi Dench'].character.shape[0]

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [29]:
Cast[(Cast['name']=='Cary Grant') & (Cast['year']==1940) & (Cast['n']==2)]

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [30]:
Cast[(Cast['name']=='Cary Grant') & (Cast['year']==1940) & (Cast['n']==1)].character

871407          Walter Burns
871448           Matt Howard
871450    C. K. Dexter Haven
Name: character, dtype: object

### How many roles were available for actors in the 1950s?

In [31]:
Cast[(Cast['year']==1950) & (Cast['type']=='actor')].character.shape[0]

16760

### How many roles were available for actresses in the 1950s?

In [32]:
Cast[(Cast['year']==1950) & (Cast['type']=='actress')].character.shape[0]

5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [33]:
Cast[(Cast['year']<1980) & (Cast['n']==1)].shape[0]

63957

### How many non-leading roles were available through from the beginning of film history through 1980?

In [34]:
Cast[(Cast['year']<1980) & (Cast['n']!=1)].shape[0]

1095378

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [35]:
Cast[(Cast['year']<=1980) & (Cast['n'].isnull())].shape[0]

448347